## Iterations over Group
Apply groupby on dataframe to create groups on different categories and iterate over it to analyse, and filter it to get desired result.

##### Import required libraries

In [1]:
import pandas as pd

In [2]:
#Splitting or Aggregations or Fiteration or Transformation
import pandas as pd

ipl_data = {'Team': ['MI', 'MI', 'Devils', 'Devils', 'Kings',
   'CSK', 'CSK', 'CSK', 'MI', 'Royals', 'Royals', 'MI'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [3]:
# Iterating through groups means walkthrough the group
#Identify yearwise records  from whole dataset

list(df.groupby('Year'))

[(2014,
       Team  Rank  Year  Points
  0      MI     1  2014     876
  2  Devils     2  2014     863
  4   Kings     3  2014     741
  9  Royals     4  2014     701),
 (2015,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  3   Devils     3  2015     673
  5      CSK     4  2015     812
  10  Royals     1  2015     804),
 (2016,
    Team  Rank  Year  Points
  6  CSK     1  2016     756
  8   MI     2  2016     694),
 (2017,
     Team  Rank  Year  Points
  7   CSK     1  2017     788
  11   MI     2  2017     690)]

##### Get records of year 2017

In [4]:
# Using pythonic way

for i in list(df.groupby('Year')):
    if i[0] == 2017:
        print(i)

(2017,    Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690)

In [5]:
# Using pandas without groupby

df[df.Year == 2017]

   Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690

In [6]:
# Using query

df.query('Year == 2017')

   Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690

In [7]:
# Using loc

df[df.loc[:,'Year'] == 2017]

   Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690

In [8]:
# Using iloc

df[df.iloc[:,2] == 2017]

   Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690

iloc will refer index of column instead of name

In [9]:
# Using get_group method

df.groupby('Year').get_group(2017)

   Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690

In [10]:
#Selecting a perticular group
df.groupby('Team').get_group('MI')

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

It will give records of team mumbai indians

In [11]:
# Get team who stood 1st max times in ipl with their count

df.groupby('Rank').get_group(1)['Team'].value_counts()

CSK       2
MI        1
Royals    1
Name: Team, dtype: int64

It indicate that CSK stood first 2 times while Royals and MI stood first single time